
## :white_check_mark: Apply Succeeded (client-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/23367)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.pagerduty_escalation_policy.mozilla_sre_escalation_policy: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=036f8808-f9ea-44f0-9b69-ba3929a4db56:ClientAPI-Prod-ECS]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/1f06e993-c1b7-4c24-a679-a5dbe25303e1]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/ClientAPI-Prod/ecs/aws-otel-collector]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
aws_acm_certificate.application_cdn_certificate_E17B2815: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/c3cba45a-abe9-4090-bece-c6fae2346b8f]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Read complete after 0s [id=2690255455]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/ClientAPI-Prod]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_caller_identity.caller: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ClientAPI-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z096910939K4PDF4XX977]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Read complete after 0s [id=pocket-data-items]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_kms_alias.kms_alias: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_region.region: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ClientAPI-Prod/ecs/app]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=clientapi-prod-app]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ClientAPI-Prod-Infrastructure-Alarm-Critical]
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Refreshing state... [id=pocket-clientapi-prod-synthetic-checks]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1756567564]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
aws_iam_role.synthetics_synthetic_check_role_A3A5C38B: Refreshing state... [id=pocket-clientapi-prod-synthetic-check]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ClientAPI-Prod-TaskExecutionRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ClientAPI-Prod-TaskRole]
data.pagerduty_escalation_policy.mozilla_sre_escalation_policy: Read complete after 0s [id=PLPWYPC]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=817188464]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ClientAPI-Prod-ECSCodeDeployRole]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z21HMDYFB951W4]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/31241111cac1b23b207c9049075752ca767858c6]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/ClientAPI-Prod-TaskRolePolicy]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Refreshing state... [id=Z096910939K4PDF4XX977__a00658900aaaf921ae7e2a29a211e0cd.client-api.getpocket.com._CNAME]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z096910939K4PDF4XX977__2f83a87c35f947890501f71c80fa8a17.direct.client-api.getpocket.com._CNAME]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=clientapi-prod-app]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PHT1L7U]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PDGDKV4]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/ClientAPI-Prod-TaskExecutionRolePolicy]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z21HMDYFB951W4_client-api.getpocket.com_NS]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ClientAPI-Prod-TaskExecutionRole-2021011323491686720000000a]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ClientAPI-Prod]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ClientAPI-Prod-ECSCodeDeployRole-2021011323491697990000000b]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ClientAPI-Prod-TaskRole-2021011323491699060000000c]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Reading...
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Refreshing state... [id=capi-prod-uptime-0]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Read complete after 0s [id=670391896]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Refreshing state... [id=pocket-clientapi-prod-synthetic-checks]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2021-12-14 06:07:37.947 +0000 UTC]
aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7: Refreshing state... [id=2021-12-14 05:32:03.073 +0000 UTC]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ClientAPI-Prod-TaskExecutionRole-20210113234916859300000009]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_vpc.memcached_vpc_F769856F: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Refreshing state... [id=arn:aws:iam::996905175585:policy/pocket-clientapi-prod-synthetic-check-access]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-0da13530698d2590c]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/CAPIbl20210113234916304400000003/244187fc032b2eb6]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/CAPIgr20210113234916416900000006/0358b556a178e6df]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=4350f69ca995db3cece27d8d92066bcdb9ef7368]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=PPU405P]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PAP129S]
data.aws_vpc.memcached_vpc_F769856F: Read complete after 0s [id=vpc-867638e3]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=PWCD1X2]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PT3S0HC]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Refreshing state... [id=capi-prod-uptime-0]
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Refreshing state... [id=pocket-clientapi-prod-synthetic-check-20230615125045544200000001]
aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C: Refreshing state... [id=clientapi-prod-elasticachesubnetgroup]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-08955472514e59284]
aws_security_group.memcached_elasticache_security_group_B1576B6B: Refreshing state... [id=sg-0f7a28a3b531bc77d]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/CAPI2021011323491776640000000e/c546aaa092741217]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ClientAPI-Prod-Infrastructure-Alarm-Non-Critical:c438b086-ba57-4453-bbec-8b29dee6e5ea]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ClientAPI-Prod-Infrastructure-Alarm-Critical:bfbfdcbd-38da-49a9-b993-6bce93975949]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Refreshing state... [id=clientapi-prod]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/CAPI2021011323491776640000000e/c546aaa092741217/0d4ce5c7d3741f53]
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Refreshing state... [id=ClientAPI-Prod-Alarm-HTTPResponseTime]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/CAPI2021011323491776640000000e/c546aaa092741217/18a5e57dc2bc40d5]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z096910939K4PDF4XX977_direct.client-api.getpocket.com_A_1]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=ClientAPI-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Refreshing state... [id=E2AUZG80IJX68J]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/CAPI2021011323491776640000000e/c546aaa092741217/0d4ce5c7d3741f53/f1406016ae7d954b]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/ClientAPI-Prod/ClientAPI-Prod]
aws_route53_record.application_cdn_record_B2BBECBB: Refreshing state... [id=Z096910939K4PDF4XX977_client-api.getpocket.com_A_2]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=2d1e8022-60f3-44d0-97ec-ba83a381e314]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ClientAPI-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ClientAPI-Prod/ClientAPI-Prod]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ClientAPI-Prod-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ClientAPI-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ClientAPI-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ClientAPI-Prod Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod:386" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "PORT"
                            value = "4001"
                        },
                      ~ {
                            name  = "RELEASE_SHA"
                          ~ value = "458a87dedc8cde8ae690d6285597abf631328da1" -> "69c5e682e4c39abbe57f87dd43f33bc8e0f52106"
                        },
                    ]
                    name                   = "app"
                    # (10 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ClientAPI-Prod" -> (known after apply)
      ~ revision                 = 386 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ClientAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ClientAPI-Prod]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=ClientAPI-Prod]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=726b326c682e8f61f1b9b56f794b13651e85009e]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"146a1411-5e52-4376-b140-3f97ae138feb","JobName":"client-api_infrastructure_apply_prod","PRNumber":100,"Program":"tfcmt","SHA1":"69c5e682e4c39abbe57f87dd43f33bc8e0f52106","Target":"client-api-cdk","Vars":{}} -->